lr changed to 0.000902500015218
[INFO] Time elapsed: 149.920289993 sec
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 64)                4416      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 17        
=================================================================
Total params: 7,041
Trainable params: 7,041
Non-trainable params: 0
_________________________________________________________________
[INFO] Model is saved as model.h5, model.json and model_weights.h5
   1000/1458423 [..............................] - ETA: 7s  28000/1458423 [..............................] - ETA: 2s  54000/1458423 [>.............................] - ETA: 2s  79000/1458423 [>.............................] - ETA: 2s 105000/1458423 [=>............................] - ETA: 2s 131000/1458423 [=>............................] - ETA: 2s 158000/1458423 [==>...........................] - ETA: 2s 185000/1458423 [==>...........................] - ETA: 2s 213000/1458423 [===>..........................] - ETA: 2s 240000/1458423 [===>..........................] - ETA: 2s 266000/1458423 [====>.........................] - ETA: 2s 292000/1458423 [=====>........................] - ETA: 2s 319000/1458423 [=====>........................] - ETA: 2s 346000/1458423 [======>.......................] - ETA: 2s 372000/1458423 [======>.......................] - ETA: 2s 399000/1458423 [=======>......................] - ETA: 2s 426000/1458423 [=======>......................] - ETA: 1s 453000/1458423 [========>.....................] - ETA: 1s 480000/1458423 [========>.....................] - ETA: 1s 506000/1458423 [=========>....................] - ETA: 1s 532000/1458423 [=========>....................] - ETA: 1s 557000/1458423 [==========>...................] - ETA: 1s 583000/1458423 [==========>...................] - ETA: 1s 609000/1458423 [===========>..................] - ETA: 1s 634000/1458423 [============>.................] - ETA: 1s 660000/1458423 [============>.................] - ETA: 1s 686000/1458423 [=============>................] - ETA: 1s 711000/1458423 [=============>................] - ETA: 1s 737000/1458423 [==============>...............] - ETA: 1s 763000/1458423 [==============>...............] - ETA: 1s 790000/1458423 [===============>..............] - ETA: 1s 817000/1458423 [===============>..............] - ETA: 1s 843000/1458423 [================>.............] - ETA: 1s 870000/1458423 [================>.............] - ETA: 1s 897000/1458423 [=================>............] - ETA: 1s 923000/1458423 [=================>............] - ETA: 1s 950000/1458423 [==================>...........] - ETA: 0s 976000/1458423 [===================>..........] - ETA: 0s1002000/1458423 [===================>..........] - ETA: 0s1027000/1458423 [====================>.........] - ETA: 0s1051000/1458423 [====================>.........] - ETA: 0s1078000/1458423 [=====================>........] - ETA: 0s1104000/1458423 [=====================>........] - ETA: 0s1130000/1458423 [======================>.......] - ETA: 0s1157000/1458423 [======================>.......] - ETA: 0s1183000/1458423 [=======================>......] - ETA: 0s1210000/1458423 [=======================>......] - ETA: 0s1236000/1458423 [========================>.....] - ETA: 0s1262000/1458423 [========================>.....] - ETA: 0s1289000/1458423 [=========================>....] - ETA: 0s1315000/1458423 [==========================>...] - ETA: 0s1341000/1458423 [==========================>...] - ETA: 0s1368000/1458423 [===========================>..] - ETA: 0s1393000/1458423 [===========================>..] - ETA: 0s1420000/1458423 [============================>.] - ETA: 0s1445000/1458423 [============================>.] - ETA: 0s[INFO] loss and metrics: [0.003483617666313788, 0.0, 0.0048848964209778929, 0.049659075634418424]
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_9 (Dense)              (None, 64)                4416      
_________________________________________________________________
dense_10 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_11 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 17        
=================================================================
Total params: 7,041
Trainable params: 7,041
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 64)                4416      
_________________________________________________________________
dense_14 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_15 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 17        
=================================================================
Total params: 7,041
Trainable params: 7,041
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_17 (Dense)             (None, 64)                4416      
_________________________________________________________________
dense_18 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_19 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 17        
=================================================================
Total params: 7,041
Trainable params: 7,041
Non-trainable params: 0
_________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_21 (Dense)             (None, 64)                4416      
_________________________________________________________________
dense_22 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_23 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 17        
=================================================================
Total params: 7,041
Trainable params: 7,041
Non-trainable params: 0
_________________________________________________________________
None
lr changed to 0.000950000045123
lr changed to 0.000902500015218
lr changed to 0.000857375003397
lr changed to 0.000814506231109
[INFO] Time elapsed: 1510.52248001 sec
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_21 (Dense)             (None, 64)                4416      
_________________________________________________________________
dense_22 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_23 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 17        
=================================================================
Total params: 7,041
Trainable params: 7,041
Non-trainable params: 0
_________________________________________________________________
[INFO] Model is saved as model.h5, model.json and model_weights.h5
